tutorials/incompressible/simpleFoam/mixingPlaneDomADomB/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2000";
    object      UFluxAvg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bladeDomB
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bladeDomA
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outletDomB
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    inletDomA
    {
        type            fixedValue;
        value           nonuniform List<vector>
100
(
(2.27476 -1.38401 0)
(2.27329 -1.38642 0)
(2.27182 -1.38882 0)
(2.27035 -1.39123 0)
(2.26887 -1.39363 0)
(2.2674 -1.39604 0)
(2.26592 -1.39844 0)
(2.26443 -1.40083 0)
...
)
;
    }
    outletDomA
    {
        type            mixingPlane;
        fluxAveraging   true;
        surfaceAveraging false;
        value           uniform (0 0 0);
    }
    inletDomB
    {
        type            mixingPlane;
        fluxAveraging   false;
        surfaceAveraging false;
        value           uniform (0 0 0);
    }
    ggi1DomB
    {
        type            ggi;
    }
    ggi1DomA
    {
        type            ggi;
    }
    ggi2DomB
    {
        type            ggi;
    }
    ggi2DomA
    {
        type            ggi;
    }
    topAndBottom
    {
        type            empty;
    }
    cyclicDomA
    {
        type            cyclic;
    }
    cyclicDomB
    {
        type            cyclic;
    }
}

// ************************************************************************* //
